/*eslint-disable*/
import HtmlViewer from "components/HtmlViewer";
import React from "react";
import ViewPageDropdown from '../../components/Dropdowns/ViewPageDropdown';
import s from './MedalProcedurePage.module.css'

export default function MedalProcedurePage() {
  const html = `<p>
              Подання про відзначення званням Герой України, Президенту України можуть 
              вносити: Верховна Рада України; Кабінет Міністрів України; Конституційний 
              Суд України; Верховний Суд України; Вищий господарський суд України; 
              Генеральна прокуратура України; міністерства та інші центральні органи 
              виконавчої влади; Верховна Рада та Рада міністрів Автономної Республіки Крим; 
              обласні, Київська та Севастопольська міські державні адміністрації; 
              Комісія державних нагород та геральдики при Президентові України.
            </p>
            <p>
              Висунення кандидатури до відзначення званням Герой України, здійснюється 
              гласно за місцем роботи особи, яку представляють до нагородження, у трудових 
              колективах підприємств, установ, організацій незалежно від типу та форми 
              власності.
            </p>
            <p>
              Клопотання про надання звання Герой України, порушується перед відповідним 
              органом чи організацією вищого рівня.
            </p>
            <p>
              Клопотання про відзначення званням Герой України, які порушуються органами 
              місцевого самоврядування, подаються Президентові України через Раду міністрів 
              Автономної Республіки Крим, відповідні обласні, Київську та Севастопольську 
              міські державні адміністрації.
            </p>
            <p>
              Клопотання про надання звання Герой України, які порушуються центральними 
              органами творчих спілок, товариств, об'єднаннями громадян, подаються через 
              Раду міністрів Автономної Республіки Крим, обласні, Київську та 
              Севастопольську міські державні адміністрації або відповідні центральні 
              органи виконавчої влади.
            </p>
            <p>
              Клопотання про надання звання Герой України керівникам міністерств, інших 
              центральних органів виконавчої влади, головам обласних, Київської та 
              Севастопольської міських державних адміністрацій вносяться Кабінетом 
              Міністрів України.
            </p>
            <p>
              Органи, яким надано право представляти до відзначення званням Герой України, 
              надсилають на ім'я Президента України подання про надання звання Герой 
              України та нагородний лист установленого зразка.
            </p>
            <p>
              У нагородному листі зазначаються конкретні заслуги особи, що стали підставою 
              для порушення клопотання про відзначення званням Герой України. У разі згоди 
              Президента з поданням, він видає указ про надання звання Герой України.
            </p>
            <p>
              Церемонія нагородження проходить у Президентському палаці в Києві.
            </p>`;

  return (
    <section className="header relative pt-32 items-center flex flex-col">
      <ViewPageDropdown />
      <HtmlViewer htmlString={html} />
    </section>
  );
}
