/*eslint-disable*/
import React from "react";
import classNames from 'classnames';
import s from './AboutPage.module.css'

export default function AboutPage() {
  return (
    <section className="header relative pt-16 items-center flex h-screen max-h-860-px">
      <div className='container'>
        <img
          className={s.medal}
          src={require("assets/img/120px-Medal_of_Golden_Star_Ukraine.png").default}
          alt="..."
        />
        <div>
          <p>
            Орден «Золота Зірка» звання Герой України виготовляється із золота і має 
            форму п'ятикутної зірки, накладеної на вінок із дубового листя. Промені 
            зірки поліровані.
            Розмір ордена між протилежними вершинами зірки 35 мм.
            Зворотний бік ордена плоский, з написом рельєфними літерами «Герой України» 
            та порядковим номером ордена.
            У верхньому промені зірки є кільце з вушком, яке сполучається з фігурною 
            колодкою, обтягнутою стрічкою. Довжина колодки — 45 мм, ширина — 28 мм. 
            На зворотному боці колодки є застібка для прикріплення ордена до одягу.
            Стрічка ордена шовкова муарова зі смужками синього і жовтого кольорів. Ширина 
            стрічки — 28 мм, ширина кожної смужки — 14 мм.
            Відповідно до Статуту відзнаки Президента України «Герой України», було 
            передбачено, що замість ордена нагороджений міг носити мініатюру ордена або 
            орденську планку, які розміщуються вище мініатюр і планок інших відзнак 
            Президента України.
            Планка ордена «Золота Зірка» — це прямокутна металева пластинка, обтягнута 
            стрічкою. На планці — позолочене зображення ордена «Золота Зірка». Розмір 
            планки: висота — 12 мм, ширина — 28 мм.
            Мініатюра ордена «Золота Зірка» є копією ордена у зменшеному вигляді.
            Згідно з чинним Статутом звання Герой України, замість ордена, особа 
            відзначена званням Герой України, може носити мініатюру ордена, яка 
            розміщується вище мініатюр і планок інших державних нагород України; 
            орденська планка не передбачена.
          </p>
          <h3>Статут звання Герой України</h3>
            <ol>
              <li>
                Звання Герой України присвоюється громадянам України за здійснення 
                визначного геройського вчинку або визначних трудових досягнень.
              </li>
              <li>
                Присвоєння звання Герой України провадиться указом Президента України.
              </li>
              <li>
                Герою України вручається орден «Золота Зірка» за здійснення визначного 
                геройського вчинку або орден Держави — за визначні трудові досягнення.
              </li>
              <li>
                Герой України, удостоєний ордена «Золота Зірка», у разі здійснення ним 
                визначних трудових досягнень може бути удостоєний ордена Держави, а 
                Герой України, удостоєний ордена Держави, у разі здійснення ним 
                геройського вчинку може бути удостоєний ордена «Золота Зірка».
              </li>
              <li>
                Присвоєння звання Герой України вдруге з удостоєнням одного й того ж 
                ордена не провадиться.
              </li>
              <li>
                Звання Герой України може бути присвоєно посмертно.
              </li>
              <li>
                Звання Герой України не присвоюється за заслуги, які мали місце в 
                минулому і не пов'язані зі становленням та розвитком незалежної України.
              </li>
            </ol>
          <h3>Процедура</h3>
          <div>
            <p>
              Подання про відзначення званням Герой України, Президенту України можуть 
              вносити: Верховна Рада України; Кабінет Міністрів України; Конституційний 
              Суд України; Верховний Суд України; Вищий господарський суд України; 
              Генеральна прокуратура України; міністерства та інші центральні органи 
              виконавчої влади; Верховна Рада та Рада міністрів Автономної Республіки Крим; 
              обласні, Київська та Севастопольська міські державні адміністрації; 
              Комісія державних нагород та геральдики при Президентові України.
            </p>
            <p>
              Висунення кандидатури до відзначення званням Герой України, здійснюється 
              гласно за місцем роботи особи, яку представляють до нагородження, у трудових 
              колективах підприємств, установ, організацій незалежно від типу та форми 
              власності.
            </p>
            <p>
              Клопотання про надання звання Герой України, порушується перед відповідним 
              органом чи організацією вищого рівня.
            </p>
            <p>
              Клопотання про відзначення званням Герой України, які порушуються органами 
              місцевого самоврядування, подаються Президентові України через Раду міністрів 
              Автономної Республіки Крим, відповідні обласні, Київську та Севастопольську 
              міські державні адміністрації.
            </p>
            <p>
              Клопотання про надання звання Герой України, які порушуються центральними 
              органами творчих спілок, товариств, об'єднаннями громадян, подаються через 
              Раду міністрів Автономної Республіки Крим, обласні, Київську та 
              Севастопольську міські державні адміністрації або відповідні центральні 
              органи виконавчої влади.
            </p>
            <p>
              Клопотання про надання звання Герой України керівникам міністерств, інших 
              центральних органів виконавчої влади, головам обласних, Київської та 
              Севастопольської міських державних адміністрацій вносяться Кабінетом 
              Міністрів України.
            </p>
            <p>
              Органи, яким надано право представляти до відзначення званням Герой України, 
              надсилають на ім'я Президента України подання про надання звання Герой 
              України та нагородний лист установленого зразка.
            </p>
            <p>
              У нагородному листі зазначаються конкретні заслуги особи, що стали підставою 
              для порушення клопотання про відзначення званням Герой України. У разі згоди 
              Президента з поданням, він видає указ про надання звання Герой України.
            </p>
            <p>
              Церемонія нагородження проходить у Президентському палаці в Києві.
            </p>
          </div>
          
        </div>
      </div>
    </section>
  );
}
