/*eslint-disable*/
import React from "react";
import classNames from 'classnames';
import s from './AboutPage.module.css'

export default function AboutPage() {
  return (
    <section className={classNames(s.AboutContainer, "relative", 'pt-24', 'items-center', 'flex')}>
      <div className={classNames('container', s.aboutPage)}>
        <img
          className={s.goldenStar}
          src={require("assets/img/120px-Medal_of_Golden_Star_Ukraine.png").default}
          alt="Орден 'Золотої Зірки'"
        />
        <div>
          <h3>Історія нагороди</h3>
          <ul className={s.history}>
            <li>
              23 серпня 1998 року Указом Президента України Л. Д. Кучми № 944/98 встановлена 
              відзнака Президента України «Герой України» (з врученням ордена «Золота Зірка» 
              або ордена Держави). Указом також затверджені Статут відзнаки Президента 
              України «Герой України» та описи орденів «Золота Зірка» та Держави.
            </li>
            <li>
              16 березня 2000 року Верховна Рада України прийняла Закон України «Про державні 
              нагороди України», у якому було передбачено, що державною нагородою України — 
              вищим ступенем відзнаки в Україні є звання Герой України (з врученням ордена 
              «Золота Зірка» або ордена Держави). Було установлено, що дія цього Закону 
              поширюється на правовідносини, пов'язані з нагородженням осіб, нагороджених 
              відзнаками Президента України до набрання чинності цим Законом; рекомендовано 
              Президентові України привести свої укази у відповідність із цим Законом.
            </li>
            <li>
              2 грудня 2002 року Указом Президента України № 1114/2002 був визнаний таким, що 
              втратив чинність, попередній Указ № 944/98; затверджено новий Статут звання Герой 
              України; затверджені нові описи ордена «Золота Зірка» та ордена Держави звання 
              Герой України і нової мініатюри до них.
            </li>
            <li>
              13 квітня 2017 року Верховна Рада ухвалила поправку до закону «Про державні 
              нагороди України», відповідно до якої, звання Герой України може бути надано, як 
              виняток, посмертно іноземцю, нагородженому орденом Героїв Небесної Сотні, за 
              здійснення визначного геройського вчинку, пов'язаного з відстоюванням 
              конституційних засад демократії, прав і свобод людини під час Революції Гідності 
              (листопад 2013 року — лютий 2014 року).
            </li>
            <li>
              28 березня 2019 року Указом Президента України № 92/2019 Статут звання Герой 
              України був доповнений положенням щодо виплати одноразової грошової винагороди 
              особам, яким надано звання Герой України за здійснення визначного геройського 
              вчинку з врученням ордена «Золота Зірка», або членам їх сімей у разі надання 
              звання Герой України з відзначенням орденом «Золота Зірка» посмертно або в разі 
              смерті особи, якій надано звання Герой України із врученням ордена «Золота Зірка», 
              у 50-кратному розмірі прожиткового мінімуму, встановленого для працездатних осіб на 
              1 січня календарного року, в якому надано звання Герой України.
            </li>
          </ul>
          <h3>Опис ордена «Золота Зірка» звання Герой України</h3>
          <p>
            Орден «Золота Зірка» звання Герой України виготовляється із золота і має 
            форму п'ятикутної зірки, накладеної на вінок із дубового листя. Промені 
            зірки поліровані.
            Розмір ордена між протилежними вершинами зірки 35 мм.
            Зворотний бік ордена плоский, з написом рельєфними літерами «Герой України» 
            та порядковим номером ордена.
            У верхньому промені зірки є кільце з вушком, яке сполучається з фігурною 
            колодкою, обтягнутою стрічкою. Довжина колодки — 45 мм, ширина — 28 мм. 
            На зворотному боці колодки є застібка для прикріплення ордена до одягу.
            Стрічка ордена шовкова муарова зі смужками синього і жовтого кольорів. Ширина 
            стрічки — 28 мм, ширина кожної смужки — 14 мм.
            Відповідно до Статуту відзнаки Президента України «Герой України», було 
            передбачено, що замість ордена нагороджений міг носити мініатюру ордена або 
            орденську планку, які розміщуються вище мініатюр і планок інших відзнак 
            Президента України.
            Планка ордена «Золота Зірка» — це прямокутна металева пластинка, обтягнута 
            стрічкою. На планці — позолочене зображення ордена «Золота Зірка». Розмір 
            планки: висота — 12 мм, ширина — 28 мм.
            Мініатюра ордена «Золота Зірка» є копією ордена у зменшеному вигляді.
            Згідно з чинним Статутом звання Герой України, замість ордена, особа 
            відзначена званням Герой України, може носити мініатюру ордена, яка 
            розміщується вище мініатюр і планок інших державних нагород України; 
            орденська планка не передбачена.
          </p>
          <h3>Статут звання Герой України</h3>
            <ol className={s.constitution}>
              <li>
                Звання Герой України присвоюється громадянам України за здійснення 
                визначного геройського вчинку або визначних трудових досягнень.
              </li>
              <li>
                Присвоєння звання Герой України провадиться указом Президента України.
              </li>
              <li>
                Герою України вручається орден «Золота Зірка» за здійснення визначного 
                геройського вчинку або орден Держави — за визначні трудові досягнення.
              </li>
              <li>
                Герой України, удостоєний ордена «Золота Зірка», у разі здійснення ним 
                визначних трудових досягнень може бути удостоєний ордена Держави, а 
                Герой України, удостоєний ордена Держави, у разі здійснення ним 
                геройського вчинку може бути удостоєний ордена «Золота Зірка».
              </li>
              <li>
                Присвоєння звання Герой України вдруге з удостоєнням одного й того ж 
                ордена не провадиться.
              </li>
              <li>
                Звання Герой України може бути присвоєно посмертно.
              </li>
              <li>
                Звання Герой України не присвоюється за заслуги, які мали місце в 
                минулому і не пов'язані зі становленням та розвитком незалежної України.
              </li>
            </ol>
          <h3>Процедура</h3>
          <div>
            <p>
              Подання про відзначення званням Герой України, Президенту України можуть 
              вносити: Верховна Рада України; Кабінет Міністрів України; Конституційний 
              Суд України; Верховний Суд України; Вищий господарський суд України; 
              Генеральна прокуратура України; міністерства та інші центральні органи 
              виконавчої влади; Верховна Рада та Рада міністрів Автономної Республіки Крим; 
              обласні, Київська та Севастопольська міські державні адміністрації; 
              Комісія державних нагород та геральдики при Президентові України.
            </p>
            <p>
              Висунення кандидатури до відзначення званням Герой України, здійснюється 
              гласно за місцем роботи особи, яку представляють до нагородження, у трудових 
              колективах підприємств, установ, організацій незалежно від типу та форми 
              власності.
            </p>
            <p>
              Клопотання про надання звання Герой України, порушується перед відповідним 
              органом чи організацією вищого рівня.
            </p>
            <p>
              Клопотання про відзначення званням Герой України, які порушуються органами 
              місцевого самоврядування, подаються Президентові України через Раду міністрів 
              Автономної Республіки Крим, відповідні обласні, Київську та Севастопольську 
              міські державні адміністрації.
            </p>
            <p>
              Клопотання про надання звання Герой України, які порушуються центральними 
              органами творчих спілок, товариств, об'єднаннями громадян, подаються через 
              Раду міністрів Автономної Республіки Крим, обласні, Київську та 
              Севастопольську міські державні адміністрації або відповідні центральні 
              органи виконавчої влади.
            </p>
            <p>
              Клопотання про надання звання Герой України керівникам міністерств, інших 
              центральних органів виконавчої влади, головам обласних, Київської та 
              Севастопольської міських державних адміністрацій вносяться Кабінетом 
              Міністрів України.
            </p>
            <p>
              Органи, яким надано право представляти до відзначення званням Герой України, 
              надсилають на ім'я Президента України подання про надання звання Герой 
              України та нагородний лист установленого зразка.
            </p>
            <p>
              У нагородному листі зазначаються конкретні заслуги особи, що стали підставою 
              для порушення клопотання про відзначення званням Герой України. У разі згоди 
              Президента з поданням, він видає указ про надання звання Герой України.
            </p>
            <p>
              Церемонія нагородження проходить у Президентському палаці в Києві.
            </p>
          </div>
        </div>
      </div>
    </section>
  );
}
