/*eslint-disable*/
import React from "react";
import SimpleEditorPage from "components/SimpleEditorPage";
import s from './MedalRegulationsEditForm.module.css'

export default function MedalRegulationsEditForm() {
  const html = `<ol>
              <li>
                Звання Герой України присвоюється громадянам України за здійснення 
                визначного геройського вчинку або визначних трудових досягнень.
              </li>
              <li>
                Присвоєння звання Герой України провадиться указом Президента України.
              </li>
              <li>
                Герою України вручається орден «Золота Зірка» за здійснення визначного 
                геройського вчинку або орден Держави — за визначні трудові досягнення.
              </li>
              <li>
                Герой України, удостоєний ордена «Золота Зірка», у разі здійснення ним 
                визначних трудових досягнень може бути удостоєний ордена Держави, а 
                Герой України, удостоєний ордена Держави, у разі здійснення ним 
                геройського вчинку може бути удостоєний ордена «Золота Зірка».
              </li>
              <li>
                Присвоєння звання Герой України вдруге з удостоєнням одного й того ж 
                ордена не провадиться.
              </li>
              <li>
                Звання Герой України може бути присвоєно посмертно.
              </li>
              <li>
                Звання Герой України не присвоюється за заслуги, які мали місце в 
                минулому і не пов'язані зі становленням та розвитком незалежної України.
              </li>
            </ol>`;
  
  const onSaveHandler = () => {};

  return (
    <section className="header relative pt-16 items-center flex flex-col">
      < SimpleEditorPage onSaveHandler={onSaveHandler} title="Редагувати Статут" text={html}/>
    </section>
  );
}
